Repository: Rathch/cru-psr14-event-list
Catalog: Resources/Private/Language/Module/*.locallang_mod.xlf
Languages: de

# mlang_labels_tabdescr
source: Shows all TYPO3 Core PSR-14 Events
de: Zeigt alle TYPO3 Core PSR-14 Events

# mlang_labels_tablabel
source: Event List
de: Event-Liste

# mlang_tabs_tab
source: PSR14 Event List
de: PSR14 Event-Liste

# overview_title
source: Overview of TYPO3 Core PSR-14 Events
de: Übersicht der TYPO3 Core PSR-14 Events

# overview_intro
source: This backend module provides a detailed overview of all available core PSR-14 events in TYPO3. PSR-14 is a standardization for event dispatching and offers a flexible way to extend the logic within TYPO3 without modifying core code. In TYPO3, PSR-14 is used to publish events that extensions and custom logic can react to.
de: Dieses Backend-Modul bietet eine detailierte Übersicht über alle verfügbaren Core PSR-14-Events in TYPO3. PSR-14 ist eine Standardisierung für Event-Dispatching und bietet eine flexible Möglichkeit, die Logik innerhalb von TYPO3 zu erweitern, ohne den Core-Code zu verändern. In TYPO3 wird PSR-14 verwendet, um Ereignisse zu veröffentlichen, auf die Erweiterungen und benutzerdefinierte Logik reagieren können.

# overview_details
source: This overview provides a complete list of all core events triggered in TYPO3, along with related information and documentation for each event. Each event is linked to the official TYPO3 documentation, so you can learn more about the event and how to use it.
de: In dieser Übersicht findest du eine vollständige Liste aller Core-Events, die in TYPO3 ausgelöst werden, sowie zugehörige Informationen und Dokumentations-Verweise zu den jeweiligen Events. Jedes Event wird mit Links zur offiziellen TYPO3-Dokumentation versehen, sodass du mehr über das Event und seine Verwendung erfahren kannst.

# documentation_text
source: For an in-depth explanation of PSR-14 and the core events in TYPO3, you can visit the official overview of core events in the TYPO3 documentation. There you will find a detailed description of the various events and examples of how to work with them.
de: Für eine ausführliche Erklärung zu PSR-14 und den Core-Events in TYPO3, kannst du die offizielle Übersicht der Core-Events in der TYPO3-Dokumentation besuchen. Dort findest du eine detaillierte Beschreibung der verschiedenen Events und Beispiele, wie du mit ihnen arbeiten kannst.

# show_events
source: To show the list, switch the action menu dropdown to "List".
de: Um die Liste anzuzeigen, wechsele im Menü-Dropdown zu "Liste".

# documentation_link
source: TYPO3 documentation
de: TYPO3 Dokumentation

# loading_warning
source: Warning: First load of the list may take a while!
de: Warnung: Der erste Ladevorgang der Liste kann eine Weile dauern!
